//Получить число Pi из Math и округлить его до двух знаков после точки
let num = Math.PI;
alert( num.toFixed(2) );


//Найти максимальное и минимальное значения из представленного ряда 10, 17, 5, 12, 15, 99, 1
alert( Math.max(10, 17, 5, 12, 15, 99, 1) );
alert( Math.min(10, 17, 5, 12, 15, 99, 1) );


//С помощью Math.random:
//получить случайное число и округлить его до двух цифр после запятой
alert( Math.random().toFixed(2) );


//получить случайное число от 0 до Х
Math.random() * (x - 0);


//Получить число из строки '100$'
Number.parseInt('100$');